taskt/Core/Automation/Commands/FileGroup/ICanHandleFileName.puml
@startuml
package "taskt.Core.Automation.Commands"{
Interface "ICanHandleFileName" {
}
}

package "taskt.Core.Automation.Commands"{
Interface "ICanHandleFileOrFolderName" {
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExpandableProperties" {
}
}


taskt.Core.Automation.Commands.ICanHandleFileOrFolderName <|-- taskt.Core.Automation.Commands.ICanHandleFileName
taskt.Core.Automation.Commands.IExpandableProperties <|-- taskt.Core.Automation.Commands.ICanHandleFileOrFolderName
@enduml
